УТ_для_edt/src/Catalogs/смартНастройкиФинансовыхПотоков/смартНастройкиФинансовыхПотоков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартНастройкиФинансовыхПотоков</name>
  <comment>//++ #Б-3852 смарт: Фролов 18.07.2025 //Разработка механизма, позволяющего перенести работу из EXCELL в 1С - Первый этап, проектирование.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ОрганизацияИлиБанк</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транзитный</name>
    <comment>//++ #Б-4676 смарт: Фролов 10.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Овернайт</name>
    <comment>//++ #Б-4750 смарт: Фролов 17.10.2025 //Доработки обработки Финансовые потоки.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаВТаблице</name>
    <comment>//++ #Б-4774 смарт: Фролов 23.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаВТаблице</name>
    <comment>//++ #Б-4774 смарт: Фролов 23.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСчета</name>
    <comment>//++ #Б-4774 смарт: Фролов 23.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартНастройкиФинансовыхПотоков/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона = Новый ХранилищеЗначения(ЦветФона);
	ТекущийОбъект.ЦветТекста = Новый ХранилищеЗначения(ЦветТекста); 
	
	ТекущийОбъект.ЦветФонаВТаблице = Новый ХранилищеЗначения(ЦветФонаВТаблице);
	ТекущийОбъект.ЦветТекстаВТаблице = Новый ХранилищеЗначения(ЦветТекстаВТаблице);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	ЦветФона = СправочникОбъект.ЦветФона.Получить();
	ЦветТекста = СправочникОбъект.ЦветТекста.Получить();
	
	ЦветФонаВТаблице = СправочникОбъект.ЦветФонаВТаблице.Получить();
	ЦветТекстаВТаблице = СправочникОбъект.ЦветТекстаВТаблице.Получить();
	
КонецПроцедуры

#КонецОбласти
